<?php
namespace app\controller;
class name {
    public function randnick(){
        return $this->nick[mt_rand(0,38)];
    }
    public function randschool(){
        return $this->school[mt_rand(0,12)];
    }
    public  $nick=[
        "゛未来只靠自己つ",
        "自强不息 ェ",
        "吹著空調，吃著西瓜——享受",
        "满身英雄梦",
        "追逐我的明天。",
        "”╰+换悸メo",
        "且美且独立",
        "跌倒后爬起来",
        "阳光总在风雨后",
        "你会坚强的@",
        "梦想起航",
        "自己努力绽放一次",
        "像向日葵一样",
        "只为轰轰烈烈的青春",
        "ゞ灬兲湸_﹏ゥ",
        "坚持下去便成王",
        "分开不是尽头",
        "爱情需要勇气",
        "学霸养成",
        "抬头就是阳光",
        "→奮鬦的屌纟",
        "梦想永遠在騷動",
        "没有不劳而获℡",
        "我的青春耗不起。",
        "太坚强是软弱",
        "压力可以比天更高",
        "好好过生活丶",
        "壮志凌云",
        "疯子的梦想",
        "功成名就",
        "一个人面对所有",
        "永不→放弃",
        "转身&未来",
        "风灵无畏",
        "最好有梦想",
        "为了孩子他娘奋斗，",
        "欣欣向荣.",
        "要一直坚持呀！",
        "仰起头不流泪@",
    ];
    public  $school=[
        '贵州医科大学神奇民族医药',
        '浙江舟山群岛新区旅游与健康',
        '宁夏葡萄酒与防沙治沙职业技术学院',
        '第一拖拉机制造厂拖拉机学院',
        '宁波大红鹰学院',
        '茅台学院',
        '宇宙联合大学',
        '普渡大学',
        '卡内基美隆大学',
        '德州农工大学',
        '西安大略大学',
        '圣母大学',
        '滑铁卢大学',
    ];
}